---
kind: method
id: M:Autodesk.Revit.DB.ForgeTypeId.op_LessThan(Autodesk.Revit.DB.ForgeTypeId,Autodesk.Revit.DB.ForgeTypeId)
source: html/83c20bb5-418e-030d-63b4-7fa6524cd406.htm
---
# Autodesk.Revit.DB.ForgeTypeId.op_LessThan Method

## Syntax (C#)
```csharp
public static bool operator <(
	ForgeTypeId lhs,
	ForgeTypeId rhs
)
```

## Parameters
- **lhs** (`Autodesk.Revit.DB.ForgeTypeId`)
- **rhs** (`Autodesk.Revit.DB.ForgeTypeId`)